In [3]:
import numpy as np
import pandas as pd
np.random.seed(42)
this=np.random.randint(0, 101, size=10)
print(f"Numpy array is {this}")
that=pd.Series(this)
print(that)

Numpy array is [51 92 14 71 60 20 82 86 74 74]
0    51
1    92
2    14
3    71
4    60
5    20
6    82
7    86
8    74
9    74
dtype: int32

In [5]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
l=pd.Series(ls)
print(l)

0        Apple
1        Tesla
2    Persimmon
3       Adidas
dtype: object

In [9]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x)

A        Apple
B        Tesla
C    Persimmon
D       Adidas
dtype: object

In [12]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.iloc[0])

Apple

In [13]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.iloc[0:3])

A        Apple
B        Tesla
C    Persimmon
dtype: object

In [16]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.loc["A"])

Apple

In [19]:
import pandas as pd
import numpy as np
np.random.seed(42)
this=np.random.randint(0, 101, size=10)
fl=pd.DataFrame(this,columns=['Numbers'])
fl

   Numbers
0       51
1       92
2       14
3       71
4       60
5       20
6       82
7       86
8       74
9       74

In [17]:
import pandas as ujwal
dat=[['Dikesh',12],['Ronish',31],['Ujwal',40]]
df=ujwal.DataFrame(dat,columns=['Name','Roll'])
df

     Name  Roll
0  Dikesh    12
1  Ronish    31
2   Ujwal    40

In [18]:
import pandas as ujwal
fil="F:/UjwalParajuli/python-class/python/practice/pandas/FSI.xlsx"
df=ujwal.read_excel(fil)
df

                      Country  Demo  Refugees  Group  Flight
0                     Somalia  10.0       9.0    8.7     8.6
1                         NaN   9.6       9.6    8.8     6.4
2                 South Sudan   9.7      10.0    8.6     6.5
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
4                       Syria   7.4       9.1    9.1     8.0
5                 Afghanistan   NaN       8.6    8.3     8.5
6                       Sudan   8.8       9.6    9.3     7.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
9                       Haiti   8.8       7.7    5.5     8.3
10                   Ethiopia   9.8       NaN    8.9     6.2
11                       Mali   8.8       8.5    8.5     7.7
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

In [21]:
import pandas as ujwal
name="F:/UjwalParajuli/python-class/python/practice/pandas/output.csv"
df=ujwal.read_csv(name,on_bad_lines="skip")
df

     Unnamed: 0                                            summary  label
0             0  भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...    1.0
1             1  विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...    2.0
2             2  इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...    0.0
3             3  पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...    0.0
4             4  अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...    1.0
..          ...                                                ...    ...
680         720  नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...    0.0
681         721  श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...    0.0
682         722  रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...    1.0
683         723  दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...    0.0
684         724  इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...    0.0

[685 rows x 3 columns]

In [22]:
df.head()

   Unnamed: 0                                            summary  label
0           0  भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...    1.0
1           1  विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...    2.0
2           2  इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...    0.0
3           3  पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...    0.0
4           4  अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...    1.0

In [23]:
df.tail()

     Unnamed: 0                                            summary  label
680         720  नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...    0.0
681         721  श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...    0.0
682         722  रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...    1.0
683         723  दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...    0.0
684         724  इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...    0.0

In [24]:
df.head(10)

   Unnamed: 0                                            summary  label
0           0  भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...    1.0
1           1  विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...    2.0
2           2  इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...    0.0
3           3  पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...    0.0
4           4  अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...    1.0
5           5  स्वाब परीक्षणको सङ्ख्या देशव्यापी रूपमा बढाएर ...    0.0
6           6  प्रधानमन्त्री प्रचण्डले द्वन्द्वकालीन मुद्दामा...    0.0
7           7  अमेरिकी राष्ट्रपति डोनल्ड ट्रम्पविरुद्ध महाभिय...    1.0
8           8  अमेरिकी राष्ट्रपति डोनल्ड ट्रम्पले अमेरिका छिर...    0.0
9           9  अमेरिकाका वैज्ञानिकहरूले क्यान्सर परीक्षणका ला...    2.0

In [25]:
print(f"The shape is {df.shape}")

The shape is (685, 3)

In [28]:
print(f"The index is {df.index}")

The index is RangeIndex(start=0, stop=685, step=1)

In [29]:
print(f"The columns are {df.columns}")

The columns are Index(['Unnamed: 0', 'summary', 'label'], dtype='object')

In [32]:
print(f"The data types are {df.dtypes})

SyntaxError: unterminated string literal (detected at line 1) (2171467885.py, line 1)